package data_source;

public class NumberScalesBG {

    public static final String[] singleAndTeen = {
            "",
            "едно",
            "две",
            "три",
            "четири",
            "пет",
            "шест",
            "седем",
            "осем",
            "девет",
            "десет",
            "единадесет",
            "дванадесет",
            "тринадесет",
            "четиринадесет",
            "петнадесет",
            "шестнадесет",
            "седемнадесет",
            "осемнадесет",
            "деветнадесет"
    };

    public static final String[] tens = {
            "",
            "",
            "двадесет",
            "тридесет",
            "четирдесет",
            "петдесет",
            "шестдесет",
            "седемдесет",
            "осемдесет",
            "деветдесет"
    };

    public static final String[] hundreds = {
            "",
            "сто",
            "двеста",
            "триста",
            "четиристотин",
            "петстотин",
            "шестстотин",
            "седемстотин",
            "осемстотин",
            "деветстотин"
    };

    public static final String[] largeNumbers = {
            "",
            "сто",
            "хиляда",
            "един милион",
            "един милиард",
            "един трилион",
            "един куадрилион",
            "един куантилион"
    };

    public static final String[] onesPrefixLargeNumbers = {
            "",
            "едно",
            "една",
            "един",
            "един",
            "един",
            "един",
            "един"
    };

    public static final String[] twosPrefixLargeNumbers = {
            "",
            "две",
            "две",
            "два",
            "два",
            "два",
            "два",
            "два"
    };

    public static final String[] largeNumbersPlural = {
            "",
            "стотин",
            "хиляди",
            "милиона",
            "милиарда",
            "трилиона",
            "куадрилиона",
            "куантилиона"
    };
}
